72.44100189208984 5.02940034866333 -59.9133186340332 24.03358268737793 3.0920557975769043 -14.89896011352539 Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Protein-Adjacency-Matrix (Input [(None, 3500, 3500)] 0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 3498, 1024)   10753024    Protein-Adjacency-Matrix[0][0]   
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 1749, 1024)   0           conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 1747, 512)    1573376     max_pooling1d[0][0]              
__________________________________________________________________________________________________
Protein-Feature-Matrix (InputLa [(None, 3500, 13)]   0                                            
__________________________________________________________________________________________________
Ligand-Adjacency-Matrix (InputL [(None, 70, 70)]     0                                            
__________________________________________________________________________________________________
Ligand-Feature-Matrix (InputLay [(None, 70, 12)]     0                                            
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 873, 512)     0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 45500)        0           Protein-Feature-Matrix[0][0]     
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 4900)         0           Ligand-Adjacency-Matrix[0][0]    
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 840)          0           Ligand-Feature-Matrix[0][0]      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 446976)       0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 256)          11648256    flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 32)           156832      flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 256)          215296      flatten_3[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          57213056    flatten[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           8224        dense_1[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 8)            264         dense_3[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 64)           16448       dense_5[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 232)          0           dense[0][0]                      
                                                                 dense_2[0][0]                    
                                                                 dense_4[0][0]                    
                                                                 dense_6[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 64)           14912       concatenate[0][0]                
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1)            65          dense_9[0][0]                    
==================================================================================================
Total params: 81,599,753
Trainable params: 81,599,753
Non-trainable params: 0
__________________________________________________________________________________________________

10.147794723510742 1.8577762842178345 -5.563516616821289 
Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Protein-Adjacency-Matrix (Input [(None, 3500, 3500)] 0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 3498, 1024)   10753024    Protein-Adjacency-Matrix[0][0]   
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 1749, 1024)   0           conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 1747, 512)    1573376     max_pooling1d[0][0]              
__________________________________________________________________________________________________
Protein-Feature-Matrix (InputLa [(None, 3500, 13)]   0                                            
__________________________________________________________________________________________________
Ligand-Adjacency-Matrix (InputL [(None, 70, 70)]     0                                            
__________________________________________________________________________________________________
Ligand-Feature-Matrix (InputLay [(None, 70, 12)]     0                                            
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 873, 512)     0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 45500)        0           Protein-Feature-Matrix[0][0]     
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 4900)         0           Ligand-Adjacency-Matrix[0][0]    
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 840)          0           Ligand-Feature-Matrix[0][0]      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 446976)       0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 256)          11648256    flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           313664      flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 256)          215296      flatten_3[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          228852224   flatten[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           8224        dense_1[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 16)           1040        dense_3[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 64)           16448       dense_5[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 624)          0           dense[0][0]                      
                                                                 dense_2[0][0]                    
                                                                 dense_4[0][0]                    
                                                                 dense_6[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 64)           40000       concatenate[0][0]                
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1)            65          dense_9[0][0]                    
==================================================================================================
Total params: 253,421,617
Trainable params: 253,421,617
Non-trainable params: 0
__________________________________________________________________________________________________

4.009276866912842 0.8608143925666809 -2.278233051300049 
Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Protein-Adjacency-Matrix (Input [(None, 3500, 3500)] 0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 3498, 1024)   10753024    Protein-Adjacency-Matrix[0][0]   
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 1749, 1024)   0           conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 1747, 512)    1573376     max_pooling1d[0][0]              
__________________________________________________________________________________________________
Protein-Feature-Matrix (InputLa [(None, 3500, 13)]   0                                            
__________________________________________________________________________________________________
Ligand-Adjacency-Matrix (InputL [(None, 70, 70)]     0                                            
__________________________________________________________________________________________________
Ligand-Feature-Matrix (InputLay [(None, 70, 12)]     0                                            
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 873, 512)     0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 45500)        0           Protein-Feature-Matrix[0][0]     
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 4900)         0           Ligand-Adjacency-Matrix[0][0]    
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 840)          0           Ligand-Feature-Matrix[0][0]      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 446976)       0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 256)          11648256    flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           313664      flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 256)          215296      flatten_3[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         457704448   flatten[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           8224        dense_1[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 16)           1040        dense_3[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 64)           16448       dense_5[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1136)         0           dense[0][0]                      
                                                                 dense_2[0][0]                    
                                                                 dense_4[0][0]                    
                                                                 dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 1024)         1164288     concatenate[0][0]                
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 512)          524800      dense_7[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 64)           32832       dense_8[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1)            65          dense_9[0][0]                    
==================================================================================================
Total params: 483,955,761
Trainable params: 483,955,761
Non-trainable params: 0
__________________________________________________________________________________________________

1.3413727283477783 0.4125688970088959 -0.5501922369003296 
Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Protein-Adjacency-Matrix (Input [(None, 3500, 3500)] 0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 3498, 1024)   10753024    Protein-Adjacency-Matrix[0][0]   
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 1749, 1024)   0           conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 1747, 512)    1573376     max_pooling1d[0][0]              
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 873, 512)     0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 871, 256)     393472      max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 435, 256)     0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
Protein-Feature-Matrix (InputLa [(None, 3500, 13)]   0                                            
__________________________________________________________________________________________________
Ligand-Adjacency-Matrix (InputL [(None, 70, 70)]     0                                            
__________________________________________________________________________________________________
Ligand-Feature-Matrix (InputLay [(None, 70, 12)]     0                                            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 111360)       0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 45500)        0           Protein-Feature-Matrix[0][0]     
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 4900)         0           Ligand-Adjacency-Matrix[0][0]    
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 840)          0           Ligand-Feature-Matrix[0][0]      
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         114033664   flatten[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 512)          23296512    flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 64)           313664      flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 256)          215296      flatten_3[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          524800      dense[0][0]                      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           32832       dense_2[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 16)           1040        dense_4[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           16448       dense_6[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 656)          0           dense_1[0][0]                    
                                                                 dense_3[0][0]                    
                                                                 dense_5[0][0]                    
                                                                 dense_7[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1024)         672768      concatenate[0][0]                
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 512)          524800      dense_8[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 64)           32832       dense_9[0][0]                    
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 1)            65          dense_10[0][0]                   
==================================================================================================
Total params: 152,384,593
Trainable params: 152,384,593
Non-trainable params: 0
__________________________________________________________________________________________________
Killed
Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Protein-Adjacency-Matrix (Input [(None, 3500, 3500)] 0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 3498, 1024)   10753024    Protein-Adjacency-Matrix[0][0]   
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 1749, 1024)   0           conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 1747, 512)    1573376     max_pooling1d[0][0]              
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 873, 512)     0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 871, 256)     393472      max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 435, 256)     0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
Protein-Feature-Matrix (InputLa [(None, 3500, 13)]   0                                            
__________________________________________________________________________________________________
Ligand-Adjacency-Matrix (InputL [(None, 70, 70)]     0                                            
__________________________________________________________________________________________________
Ligand-Feature-Matrix (InputLay [(None, 70, 12)]     0                                            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 111360)       0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 45500)        0           Protein-Feature-Matrix[0][0]     
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 4900)         0           Ligand-Adjacency-Matrix[0][0]    
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 840)          0           Ligand-Feature-Matrix[0][0]      
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         114033664   flatten[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 512)          23296512    flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 64)           313664      flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 256)          215296      flatten_3[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          524800      dense[0][0]                      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           32832       dense_2[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 16)           1040        dense_4[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           16448       dense_6[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 656)          0           dense_1[0][0]                    
                                                                 dense_3[0][0]                    
                                                                 dense_5[0][0]                    
                                                                 dense_7[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1024)         672768      concatenate[0][0]                
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 512)          524800      dense_8[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 64)           32832       dense_9[0][0]                    
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 1)            65          dense_10[0][0]                   
==================================================================================================
Total params: 152,384,593
Trainable params: 152,384,593
Non-trainable params: 0
__________________________________________________________________________________________________

Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Protein-Adjacency-Matrix (Input [(None, 3500, 3500)] 0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 3498, 1024)   10753024    Protein-Adjacency-Matrix[0][0]   
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 1749, 1024)   0           conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 1747, 512)    1573376     max_pooling1d[0][0]              
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 873, 512)     0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 871, 256)     393472      max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 435, 256)     0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
Protein-Feature-Matrix (InputLa [(None, 3500, 13)]   0                                            
__________________________________________________________________________________________________
Ligand-Adjacency-Matrix (InputL [(None, 70, 70)]     0                                            
__________________________________________________________________________________________________
Ligand-Feature-Matrix (InputLay [(None, 70, 12)]     0                                            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 111360)       0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 45500)        0           Protein-Feature-Matrix[0][0]     
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 4900)         0           Ligand-Adjacency-Matrix[0][0]    
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 840)          0           Ligand-Feature-Matrix[0][0]      
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         114033664   flatten[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 512)          23296512    flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 64)           313664      flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 256)          215296      flatten_3[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          524800      dense[0][0]                      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           32832       dense_2[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 16)           1040        dense_4[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           16448       dense_6[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 656)          0           dense_1[0][0]                    
                                                                 dense_3[0][0]                    
                                                                 dense_5[0][0]                    
                                                                 dense_7[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1024)         672768      concatenate[0][0]                
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 512)          524800      dense_8[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 64)           32832       dense_9[0][0]                    
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 1)            65          dense_10[0][0]                   
==================================================================================================
Total params: 152,384,593
Trainable params: 152,384,593
Non-trainable params: 0
__________________________________________________________________________________________________

1.0033252239227295 0.32573312520980835 -0.6474645137786865 
